In [2]:
import pandas as pd
import numpy as np

dataset = pd.read_csv("titanic.csv")
dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
rows, columns = dataset.shape
print("Rows: " +  str(rows))
print("Columns: " + str(columns))

Rows: 891
Columns: 12

In [4]:
dataset[['Age','Fare']]

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [5]:
dataset['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [6]:
newDataset = dataset[['Age','Fare']]

newDataset['Age'] = dataset['Age'].fillna(
    dataset.groupby(['Survived'])['Age'].transform('mean')
)

newDataset['Age']

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    30.626179
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [21]:
minVal, maxVal = 0, 1

dataMinMax = newDataset[['Age','Fare']]

dataMinMax['Age'] = \
    (newDataset['Age'] - newDataset['Age'].min()) * (maxVal - minVal) \
    / (newDataset['Age'].max()-newDataset['Age'].min()) + minVal

dataMinMax['Fare'] = \
    (newDataset['Fare'] - newDataset['Fare'].min()) * (maxVal - minVal) \
    / (newDataset['Fare'].max()-newDataset['Fare'].min())+minVal

dataMinMax

          Age      Fare
0    0.271174  0.014151
1    0.472229  0.139136
2    0.321438  0.015469
3    0.434531  0.103644
4    0.434531  0.015713
..        ...       ...
886  0.334004  0.025374
887  0.233476  0.058556
888  0.379570  0.045771
889  0.321438  0.058556
890  0.396833  0.015127

[891 rows x 2 columns]

In [8]:
dataZScore = newDataset[['Age','Fare']]

dataZScore['Age'] = \
    (newDataset['Age'] - newDataset['Age'].mean()) \
    / newDataset['Age'].std()

dataZScore['Fare'] = \
    (newDataset['Fare'] - newDataset['Fare'].mean()) \
    / newDataset['Fare'].std()

dataZScore

          Age      Fare
0   -0.595670 -0.502163
1    0.634089  0.786404
2   -0.288230 -0.488580
3    0.403509  0.420494
4    0.403509 -0.486064
..        ...       ...
886 -0.211370 -0.386454
887 -0.826250 -0.044356
888  0.067338 -0.176164
889 -0.288230 -0.044356
890  0.172929 -0.492101

[891 rows x 2 columns]

In [9]:
dataSigmoidal = newDataset[['Age','Fare']]

dataSigmoidal['Age'] = \
    (1 - np.exp(-1*dataZScore['Age'])) \
    / (1 + np.exp(-1*dataZScore['Age']))

dataSigmoidal['Fare'] = \
    (1 - np.exp(-1*dataZScore['Fare'])) \
    / (1 + np.exp(-1*dataZScore['Fare']))

dataSigmoidal

          Age      Fare
0   -0.289330 -0.245935
1    0.306832  0.374117
2   -0.143126 -0.239544
3    0.199061  0.207203
4    0.199061 -0.238358
..        ...       ...
886 -0.105293 -0.190857
887 -0.391123 -0.022174
888  0.033656 -0.087855
889 -0.143126 -0.022174
890  0.086250 -0.241203

[891 rows x 2 columns]